#pragma once
#include <iostream>

struct GameField // Оголошення структури, що зберігає дані ігрового поля
{
	int sizef;

	int** board; // Поле структури, що зберігає двовимірний масив даних, тобто саме поле

	struct empty_point { // Оголошення структури, що зберігає координати порожньої клітинки 
		int x;
		int y;
	} coordinates; // Оголошення структурної змінної

	enum game_status // Оголошення перелічення, що містить в собі кожен стан гри
	{
		Active, Win, Pause
	} status; // Оголошення enum-змінної 

	void create_board(int size); // Прототип функції, що відповідає за початкову ініціалізацію ігрового поля

	bool is_move(int x, int y); // Прототип функції, що відповідає за перевірку можливості ходу
	
	bool operator >>(int token); // Прототип перевизначеної функції, що відповідає за пересування фішки по ігровому полю

	bool is_win(); // Прототип функції, що відповідає за перевірку виграшу
	
};

std::ostream& operator<<(std::ostream& out, const GameField& var); // Перенавантаження оператора << для зручнішого виведення ігрового поля в консоль