#pragma once

struct GameField // Оголошення структури, що зберігає дані ігрового поля
{
	int sizef;

	int** board; // Поле структури, що зберігає двовимірний масив даних, тобто саме поле

	struct empty_point { // Оголошення структури, що зберігає координати порожньої клітинки 
		int x;
		int y;
	} coordinates; // Оголошення структурної змінної

	enum game_status // Оголошення перелічення, що містить в собі кожен стан гри
	{
		Active, Win, Pause
	} status; // Оголошення enum-змінної 

	void create_board(int size); // Прототип функції, що відповідає за початкову ініціалізацію ігрового поля

	void output_board(); // Прототип функції, що відповідає за виведення ігрового поля на екран консолі

	bool is_move(int x, int y); // Прототип функції, що відповідає за перевірку можливості ходу
	
	bool move_token(int token); // Прототип функції, що відповідає за пересування фішки по ігровому полю

	bool is_win(); // Прототип функції, що відповідає за перевірку виграшу
	
};