#include <iostream> // Підключення бібліотеки для забезпечення потокового вводу/виводу
#include "gameField.h" // Підключення створеного заголовочного файлу, що містить структуру GameField

void GameField::create_board(int size) // Визначення функції, що відповідає за початкову ініціалізацію ігрового поля
{
	board = new int*[size]; // Динамічне виділення пам'яті під масив рядків
	for (int i = 0; i < size; i++) // Цикл по рядкам
	{
		board[i] = new int[size]; // Динамічне виділення пам'яті для стовпців
	}
	int token_value = size * size - 1; // Прораховане значення останньої фішки
	for (int i = 0; i < size; i++) // Цикл по рядкам
	{
		for (int j = 0; j < size; j++) // Цикл по стовпцям
		{
			if (i == size - 1 && j == size - 1) // Якщо дана фішка є останньою
			{
				// Запис координат порожньої фішки
				coordinates.x = i;
				coordinates.y = j;
				board[i][j] = 0; // Ініціалізація значення порожньої фішки як нуль
				if (size % 2 == 0) // Якщо розмір поля парне число
				{
					// Зміна місцями елементів поля для забезпечення можливості виграшу
					int swap = board[i][j - 2];
					board[i][j - 2] = board[i][j - 1];
					board[i][j - 1] = swap;
				}
			}
			else // Якщо ж дана фішка не є останньою
			{
				board[i][j] = token_value; // Заповнення числом
				token_value--; // Зменшення даного числа на одну одиницю
			}
		}
	}
}

void GameField::output_board(int size) // Визначення функції, що відповідає за виведення ігрового поля на екран консолі
{
	for (int i = 0; i < size; i++) // Цикл по рядкам
	{
		std::cout << std::endl; // Відступ
		for (int j = 0; j < size; j++) // Цикл по стовпцям
		{
			if (i == coordinates.x && j == coordinates.y) // Якщо знайдено порожню клітинку
			{
				std::cout << "_\t"; // Виводиться знак нижнього підкреслення
			}
			else // Якщо це звичайна клітинка
			{
				std::cout << board[i][j] << "\t"; // Виводиться значення даної клітинки
			}
		}
	}
}