#pragma once
#include "gameField.h"
#define MinGameFieldSize 3 // Директива препроцесора, що відповідає за мінімальний розмір ігрового поля
#define MaxGameFieldSize 9 // Директива препроцесора, що відповідає за максимальний розмір ігрового поля


struct GameController // Оголошення структури, що відповідає за контроль гри на рівні програми
{
	GameField game_board; // Оголошення змінної, що зберігає всі дані ігрового поля
	int move_count; // Оголошення змінної, що зберігає підраховане значення кількості ходів гравця за гру
	void start_game(); // Прототип функції, що відповідає за початок гри
	
	int input_checking(int number) // Прототип функції, що відповідає за обробку введення користувача
	{
		return number; // Повертає ціле число, введене користувачем
	}
	void game_loop(); // Прототип функції, що відповідає за логіку основного ігрового циклу
	
};
