// lab_C_plus_plus_4-10.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <Windows.h> // Бібліотека для виведення символів кириці в консоль
#include "gameController.h" // Підключення модуля, що містить в собі реалізацію структури GameController

int main() // Головна функція програми
{
	SetConsoleOutputCP(1251); // Встановлення кодування консолі Windows-1251
	SetConsoleCP(1251); // Встановлення кодування консолі Windows-1251

	GameController game; // Створення змінної типу GameController

	game.start_game(); // Запуск методу, що відповідає за початок гри

	return 0; // Завершення роботи програми з кодом успіху
}
 
